export interface Season {
  season_id: number;
  season_image_url: string;
  season_name: string;
  season_description: string;
}

export const allAnime: Season[] = [
  {
    season_id: 9365736,
    season_image_url: "../src/assets/images/1.png",
    season_name: "Магическая битва",
    season_description:
      "Мир, в котором демоны питаются людьми, а те об этом даже не догадываются. Когда-то давно самый могущественный демон был повержен, а части его тела разбросаны по свету. Тот, кто сможет их собрать и поглотить, получит безграничную власть и даже сможет уничтожить человечество.",
  },
  {
    season_id: 7365732,
    season_image_url: "../src/assets/images/2.jpg",
    season_name: "Магическая битва 2",
    season_description:
      "Однажды Юдзи находит странную шкатулку и приносит на очередное заседание клуба. Случайно открыв шкатулку, парни выпускают наружу «проклятие». Не понимая как, Юдзи случайно проглотил монстра, чем спас друзей. Теперь парень стал наполовину монстр.",
  },
  {
    season_id: 23653654,
    season_image_url: "../src/assets/images/3.png",
    season_name: "Звездное дитя",
    season_description:
      "Жизнь звёзд эстрады наполнена яркими событиями, а также огромными гонорарами. Вот только фанаты видят лишь позитивную сторону айдолов, которым приходиться жертвовать многим, чтобы добиться успеха. Однажды преуспевающий доктор лечил девчонку, которая скоропостижно скончалась. ",
  },
  {
    season_id: 65365736,
    season_image_url: "../src/assets/images/4.png",
    season_name: "Этот глупый свин не понимает мечту девочки-зайки",
    season_description:
      "Однажды старшеклассник Сакута встречает Маи — известную актрису, на которую никто не обращает внимания, несмотря на то, что девушка одета в вызывающий костюм кролика. Юноша решает помочь Маи выяснить, почему люди перестали её замечать.",
  },
  {
    season_id: 9365736,
    season_image_url: "../src/assets/images/5.jpeg",
    season_name: "Провожающая в последний путь Фрирен",
    season_description:
      "После 10-летнего путешествия и победы на королём демонов отряд героев возвращается в родные края, чтобы расстаться навсегда. Эльфийка Фрирен с горечью наблюдает, как её спутники один за другим уходят из жизни, ведь эльфы живут дольше людей.",
  },
  {
    season_id: 7365732,
    season_image_url: "../src/assets/images/6.png",
    season_name: "Ванпанчмен",
    season_description:
      "Парень по имени Сайтама живёт в мире, иронично похожем на наш. Ему 25, он лыс и прекрасен и к тому же силен настолько, что с одного удара аннигилирует всё, что представляет опасность для человечества. Он ищет себя в этой жизни, попутно раздавая подзатыльники монстрам и злодеям.",
  },
  {
    season_id: 23653654,
    season_image_url: "../src/assets/images/7.png",
    season_name: "Монолог фармацевта",
    season_description:
      "При императорском дворе в древнем Китае прошло несколько месяцев с тех пор, как 17-летнюю девушку, известную как Маомао, похитили и заставили работать служанкой низшего уровня во дворце императора.",
  },
  {
    season_id: 65365736,
    season_image_url: "../src/assets/images/8.jpg",
    season_name: "Клинок рассекающий демонов",
    season_description:
      "Ходят слухи, что в местных лесах обитают кровожадные демоны, которые питаются человеческой плотью. Вот только последние инциденты были так давно, что люди позабыли об опасностях дремучих лесов. Многие жители деревни считают, что сказание о демонах это просто страшилки и легенды.",
  },
];
